scc2425-tukano/src/main/test/artillery/shorts/get_short.yaml
config:
  target: https://deployment-scc-backend-smd-71848.azurewebsites.net/rest
  phases:
    - name: get_short
      duration: 3
      arrivalCount: 1
scenarios:
  - name: TuKanoGetShort
    flow:
      - get:
          url: "/shorts/user1+ee6b6bd7-7cf8-4211-b5b0-b7c98259c84a" #assuming short id in db
          headers:
            Accept: application/json